###############################################################
#  Generated by:      Cadence Innovus 19.13-s080_1
#  OS:                Linux x86_64(Host ID cadence212)
#  Generated on:      Mon Sep 12 18:56:17 2022
#  Design:            mtm_riscv_chip
#  Command:           write_db ./saved/mtm_riscv_chip_10_postroute_opt.db
###############################################################
current_design mtm_riscv_chip
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_pins {u_pads_in/u_clk/C}]  -name Tclk -period 20.000000 -waveform {0.000000 10.000000}
set_max_transition -clock_path -rise 4  [get_clocks {Tclk}]
set_max_transition -data_path -rise 4  [get_clocks {Tclk}]
set_clock_transition  -rise -min 0.1 [get_clocks {Tclk}]
set_clock_transition  -rise -max 0.1 [get_clocks {Tclk}]
set_clock_transition  -fall -min 0.1 [get_clocks {Tclk}]
set_clock_transition  -fall -max 0.1 [get_clocks {Tclk}]
set_propagated_clock  [get_pins {u_pads_in/u_clk/C}]
set_max_fanout 4  [get_ports {clk}]
set_input_transition 0.5  [get_ports {clk}]
set_max_fanout 4  [get_ports {rst_n}]
set_input_transition 0.5  [get_ports {rst_n}]
set_load -pin_load -max  30  [get_ports {gpio_out[4]}]
set_load -pin_load -min  30  [get_ports {gpio_out[4]}]
set_load -pin_load -max  30  [get_ports {gpio_out[3]}]
set_load -pin_load -min  30  [get_ports {gpio_out[3]}]
set_load -pin_load -max  30  [get_ports {gpio_out[2]}]
set_load -pin_load -min  30  [get_ports {gpio_out[2]}]
set_load -pin_load -max  30  [get_ports {gpio_out[1]}]
set_load -pin_load -min  30  [get_ports {gpio_out[1]}]
set_load -pin_load -max  30  [get_ports {gpio_out[0]}]
set_load -pin_load -min  30  [get_ports {gpio_out[0]}]
set_max_fanout 4  [get_ports {gpio_in[3]}]
set_input_transition 0.5  [get_ports {gpio_in[3]}]
set_max_fanout 4  [get_ports {gpio_in[2]}]
set_input_transition 0.5  [get_ports {gpio_in[2]}]
set_max_fanout 4  [get_ports {gpio_in[1]}]
set_input_transition 0.5  [get_ports {gpio_in[1]}]
set_max_fanout 4  [get_ports {gpio_in[0]}]
set_input_transition 0.5  [get_ports {gpio_in[0]}]
set_load -pin_load -max  30  [get_ports {ss}]
set_load -pin_load -min  30  [get_ports {ss}]
set_load -pin_load -max  30  [get_ports {sck}]
set_load -pin_load -min  30  [get_ports {sck}]
set_load -pin_load -max  30  [get_ports {mosi}]
set_load -pin_load -min  30  [get_ports {mosi}]
set_max_fanout 4  [get_ports {miso}]
set_input_transition 0.5  [get_ports {miso}]
set_load -pin_load -max  30  [get_ports {sout}]
set_load -pin_load -min  30  [get_ports {sout}]
set_max_fanout 4  [get_ports {sin}]
set_input_transition 0.5  [get_ports {sin}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_in[2]}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_in[0]}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {rst_n}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {sin}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_in[3]}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {clk}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_in[1]}]
set_input_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {miso}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_out[1]}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {sck}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_out[4]}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {mosi}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_out[2]}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_out[0]}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {ss}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {sout}]
set_output_delay -add_delay 5 -clock [get_clocks {Tclk}] [get_ports {gpio_out[3]}]
set_clock_uncertainty 0.05 -hold [get_clocks {Tclk}]
set_clock_uncertainty 0.1 -setup [get_clocks {Tclk}]
